<?php
    error_reporting(E_ERROR | E_WARNING | E_PARSE);
    header("Content-Type:application/javascript");
    $key = $_GET["wd"];
    $cb = $_GET["cb"];
    $param = $_GET["param"];
    if($param == ''){
	    if($key == '1'){
	            /*用s作为获取数据的键值*/
	         echo $cb.'({s:["192.168.1.1","163邮箱","115网盘","10+10","11对战平台","1080p","123网址之家","12593","1号店"]});';
	    }
	    else if($key == '19'){
	         echo $cb.'({s:["192.168.1.1", "1912年", "19岁的纯情", "1976年", "19楼", "1998年", "1997年", "1988年"]});';
	    }
	    else if($key == '192'){
	         echo $cb.'({s:["192.168.1.1", "1921年", "1929-1933经济危机", "1924年", "1928年", "1927年", "1926年", "1920年", "1929年世界经济危机", "1925年"]});';
	    }
	    else if($key == '1925'){
	         echo $cb.'({s:[ "1925年", "1925-1933经济危机", "1924年", "1928年", "1927年", "1926年", "1920年", "1929年世界经济危机", "1925年"]});';
	    }
	    else if($key == '2'){
	     	 echo $cb.'({s:["2pm", "2012我爱hk喜上加囍", "2012", "2ne1", "2011感动中国十大人物", "2am", "211工程", "2013年春节放假安排", "2012年伦敦奥运会"]});';
	    }
	    else if($key == '2pm'){
	    	echo $cb.'({s:["hehe"]});';
	    }
	    else if($key =='5'){
	         echo $cb.'({s:["54青年节","54运动"]})';
	    }
	    else if($key =='6'){
	         echo $cb.'({s:["64青年节","64运动"]})';
	    }
	    else {
	    	echo $cb.'({});';
	    }
    }
    else{
    	if($key == '1'){
	         echo $cb.'({s:["param1"]});';
	    }
    }
   ?>